In [1]:
import pandas as pd;

In [3]:
data = {
 'name':['vishal', 'om', 'shubz', 'omkar'],
 'age':[22,33,44,55], 
 'department':['Computer', 'It', 'Cs', 'AI-ML'], 
'salary':[33333,44444,55555,66666]
}

data = pd.DataFrame(data)
data

     name  age department  salary
0  vishal   22   Computer   33333
1      om   33         It   44444
2   shubz   44         Cs   55555
3   omkar   55      AI-ML   66666

In [5]:
data.isnull()

    name    age  department  salary
0  False  False       False   False
1  False  False       False   False
2  False  False       False   False
3  False  False       False   False

In [8]:
import numpy as np;
data.loc[data.name == 'vishal', 'Salary'] = np.nan

In [9]:
data

     name  age department  salary  Salary
0  vishal   22   Computer   33333     NaN
1      om   33         It   44444     NaN
2   shubz   44         Cs   55555     NaN
3   omkar   55      AI-ML   66666     NaN

In [11]:
data.isnull()

    name    age  department  salary  Salary
0  False  False       False   False    True
1  False  False       False   False    True
2  False  False       False   False    True
3  False  False       False   False    True

In [12]:
data.isnull().sum()

name          0
age           0
department    0
salary        0
Salary        4
dtype: int64

In [13]:
data.fillna(0)

     name  age department  salary  Salary
0  vishal   22   Computer   33333     0.0
1      om   33         It   44444     0.0
2   shubz   44         Cs   55555     0.0
3   omkar   55      AI-ML   66666     0.0